tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'vitorgalvao/tiny-scripts'
tap 'buo/cask-upgrade'

tap 'sscotth/homebrew-sip'

# UPDATE OS X APPS
brew 'bash'
brew 'binutils'
brew 'coreutils'
brew 'diffstat'
brew 'diffutils'
brew 'ed', args: ['with-default-names']
brew 'emacs'
brew 'expect'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'git'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-units', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gpatch'
brew 'gperf'
brew 'grep', args: ['with-default-names']
brew 'groff'
brew 'gzip'
brew 'less'
brew 'make', args: ['with-default-names']
brew 'moreutils'
brew 'nano'
brew 'openssh'
brew 'openssl'
brew 'python'
brew 'rsync'
brew 'screen'
brew 'svn'
brew 'tccutil'
brew 'tidy-html5'
brew 'vim', args: ['override-system-vi']
brew 'wget'
brew 'zsh'

# APPS
brew 'ack'
brew 'archey'
brew 'argtable'
brew 'aria2'
brew 'cask-repair'
brew 'chruby'
brew 'diff-so-fancy'
brew 'flow'
brew 'graphicsmagick'
brew 'handbrake'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'jq'
brew 'lolcat'
brew 'mackup'
brew 'mas'
brew 'mongodb'
brew 'mysql@5.7'
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'python3'
brew 'r'
brew 'ranger'
brew 'rclone'
brew 'rethinkdb'
brew 'ruby-install', args: ['HEAD']
brew 's3cmd'
brew 'shellcheck'
brew 'sshuttle'
brew 'syncthing-inotify'
brew 'syncthing'
brew 'tccutil'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'watchman'
brew 'z'

# CASK APPS
cask '1password6' # Password manager -- newest requires subscription
cask 'aerial' # Apple TV Aerial Views Screen Saver
cask 'airmail-beta' # Email client (beta only cask)
cask 'airserver' # Airplay & Google Cast screen mirroring receiver
cask 'airtool' # Wireless configuration and capture
cask 'alfred' # Spotlight alternative
cask 'angry-ip-scanner' # IP/Port scanner
cask 'anydesk' # Screen sharing
cask 'apache-couchdb' # Database
cask 'appcleaner' # App uninstaller
cask 'arduino' # IDE for Arduino
# cask 'asepsis' # Prevents .DS_Store files (disable SIP)
cask 'atom-beta' # Text editor
cask 'atom' # Text editor
cask 'audiobookbinder' # Create iTunes compatible .m4b audiobooks
cask 'balsamiq-mockups' # Wireframing
cask 'bartender' # Hides menubar items
cask 'burn' # CD burner
cask 'busycal' # Calendar manager
cask 'busycontacts' # Contacts manager
cask 'cardhop' # Contacts manager
cask 'ccleaner' # System cleanup
cask 'charles' # Debugging Proxy
cask 'chatology' # iMessage enhancer
cask 'chromium' # Web browser
cask 'clover-configurator' # Clover bootloader editor
cask 'dash' # Offline API Documentation
cask 'devonthink-pro-office' # Evernote alternative
cask 'discord-canary' # Chat
cask 'discord' # Chat
cask 'docker' # App containers
cask 'dropbox' # Cloud backup
cask 'duet' # ipad as second monitor
cask 'etcher' # Image writer
cask 'fantastical' # Calendar
cask 'filezilla' # FTP
cask 'firefox-developer-edition' # Web broswer
cask 'firefox' # Web broswer
cask 'flash-npapi' # Flash for Safari & Firefox. PPAPI is for Chromium & Opera
cask 'flux' # Screen colorization based on time
cask 'fontplop' # create webfonts from .ttf
cask 'free-ruler' # Pixel ruler
cask 'frescobaldi' # Music notation
cask 'gas-mask' # Hosts file manager
cask 'gisto' # Github gist manager
cask 'github' # Github repo manager
cask 'gitkraken' # Git repo manager
cask 'gitter' # Chat
cask 'glyphs' # Font editor
cask 'google-chrome-canary' # Browser
cask 'google-chrome' # Browser
cask 'google-drive-file-stream' # Cloud backup
cask 'gpg-suite' # OpenPGP
cask 'grandperspective' # File system analyzer
cask 'handbrake' # Video transcoder
cask 'haskell-for-mac' # IDE for haskell
cask 'integrity' # Website link checker (Also on app store)
cask 'istat-menus' # Menubar widgets
cask 'iterm2' # Terminal emulator
cask 'itsycal' # Menubar calendar
cask 'java8' # Required for Java Apps
cask 'jdownloader' # Download manager
cask 'kaleidoscope' # File diff
cask 'karabiner-elements' # Keyboard customization
cask 'keka' # File compression
cask 'kodi' # Media player
cask 'leech' # Download manager
cask 'libreoffice' # Office applications
cask 'lilypond-dev' # Music notation
cask 'little-snitch' # Firewall
cask 'lmms' # Digital audio
cask 'logitech-unifying' # Logitech drivers
cask 'losslesscut' # Trim video and audio files
cask 'makemkv' # Bluray rip - Free registration https://www.makemkv.com/forum/viewtopic.php?f=5&t=1053
cask 'mamp' # macOS, apache, mysql, php stack app
cask 'marked' # preview markdown from any editor
cask 'meshcommander' # Intel AMT
cask 'microsoft-office' # Office applications
cask 'mongodb-compass' # MongoDB GUI
cask 'monodraw' # Plain text drawing
cask 'moom' # Window manager
cask 'mp3tag' # Mp3 metadata editor
cask 'mpv' # Media player
cask 'musescore' # Music notation
cask 'mysqlworkbench' # MySQL GUI
cask 'navicat-premium' # Multi-database GUI
cask 'ngrok' # Public tunnel to localhost
cask 'nvalt' # Notes
cask 'obs' # Screen broadcasting
cask 'omnifocus' # Task manager
cask 'onyx' # System maintence
cask 'parallels' # Virtual machines
cask 'paw' # API tester
cask 'plex-media-player' # Media player
cask 'plex-media-server' # Media server
cask 'postgres' # Database
cask 'postico' # PostgresSQL GUI
cask 'qsyncthingtray' # Syncthing tray icon
cask 'quickbooks2016' # Accounting
cask 'rclone-browser' # rclone GUI
cask 'rescuetime' # Time tracker
cask 'robo-3t' # MongoDB GUI
cask 'robofont' # Font editor
cask 'rstudio' # IDE for R
cask 'screens' # VNC client
cask 'scroll-reverser' # Mouse scroll wheel change
cask 'sketch-beta' # Vector drawing
cask 'slack' # Chat
cask 'soundflower' # Virtual audio interface
cask 'sourcetree' # Git repo manager
cask 'spectacle' # Window manager
cask 'steam' # Games
cask 'steelseries-exactmouse-tool' # Mouse deacceleration
cask 'stremio' # Media streaming
cask 'studio-3t' # IDE for MongoDB
cask 'sublime-merge' # Git repo manager
cask 'sublime-text' # Text editor
cask 'synergy' # Mouse and keyboard sharing
cask 'tableplus' # Multi-database GUI
cask 'teamviewer' # Screen sharing
cask 'telegram' # Chat
cask 'tomighty' # Task timer
cask 'totalfinder' # Finder enhancer (disable SIP)
cask 'tower' # Git repo manager
cask 'transmission' # Torrent downloader
cask 'tripmode' # Mobile data blocker
cask 'tunnelblick' # VPN client
cask 'veracrypt' # Encryption. TrueCrypt fork
cask 'virtualbox-extension-pack' # Support for USB 2.0 and USB 3.0 devices, VirtualBox RDP, disk encryption, NVMe and PXE boot for Intel cards
cask 'virtualbox' # Virtual machines
cask 'viscosity' # VPN client
cask 'visual-studio-code' # Text editor
cask 'vlc' # Media player
cask 'vmware-fusion' # Virtual machines
cask 'webstorm' # IDE for JavaScript
cask 'wireshark' # Network analyzer
cask 'xld' # FLAC lossless audio
# cask 'xtrafinder' # Finder enhancer

# [Quick Look Plugins](https://github.com/sindresorhus/quick-look-plugins)
# Not sorted
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
# cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-pat'

# FONTS
# brew search /powerline/ | grep font | xargs brew cask install
cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-noto-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu-mono-derivative-powerline'

cask 'font-hack'
cask 'font-monoid'

# DRIVERS
cask 'asix-ax88179'
cask 'xbox360-controller-driver-unofficial'

# APP STORE
mas 'Day One Classic', id: 422304217
mas 'Deckset', id: 847496013
mas 'LimeChat', id: 414030210
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334
mas 'Xcode', id: 497799835

# PREREQ
cask 'osxfuse'
# cask 'xquartz'
#
# brew 'ntfs-3g' # Requires osxfuse
# brew 'sshfs' # Requires osxfuse
# cask 'fontforge' # Requires xforce
brew 'macvim', args: ['with-custom-icons'] # Requires Xcode
