tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

tap 'buo/cask-upgrade'
tap 'heroku/brew'
tap 'vitorgalvao/tiny-scripts'

tap 'sscotth/sip'
tap 'sscotth/personal'

# UPDATE OS X APPS
brew 'bash'
brew 'binutils'
brew 'coreutils'
brew 'diffstat'
brew 'diffutils'
brew 'ed'
brew 'emacs'
brew 'expect'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'git'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-units'
brew 'gnu-which'
brew 'gpatch'
brew 'gperf'
brew 'grep'
brew 'groff'
brew 'gzip'
brew 'less'
brew 'make'
brew 'moreutils'
brew 'nano'
brew 'openssh'
brew 'openssl'
brew 'python'
brew 'rsync'
brew 'screen'
brew 'svn'
brew 'tccutil'
brew 'tidy-html5'
brew 'vim'
brew 'wget'
brew 'zsh'

# APPS
brew 'ack'
brew 'archey'
brew 'argtable'
brew 'aria2'
brew 'bat'
brew 'carthage'
brew 'cask-repair'
brew 'chruby'
brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'flow'
brew 'git-lfs'
brew 'graphicsmagick'
brew 'gron'
brew 'handbrake'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'jq'
brew 'lolcat'
brew 'mackup'
brew 'mas'
brew 'mysql@5.7'
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'prettyping'
brew 'python3'
brew 'r'
brew 'ranger'
brew 'rclone'
brew 'rethinkdb'
brew 'ruby-install', args: ['HEAD']
brew 's3cmd'
brew 'shellcheck'
brew 'sshuttle'
brew 'syncthing'
brew 'syncthing-inotify'
brew 'tccutil'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'watchman'
brew 'yarn'
brew 'z'
brew 'zsh-completions'

# CASK APPS
cask '1password' # Password manager
cask 'adoptopenjdk8' # Java8
cask 'aerial' # Apple TV Aerial Views Screen Saver
cask 'airserver' # Airplay & Google Cast screen mirroring receiver
cask 'airtool' # Wireless configuration and capture
cask 'alfred' # Spotlight alternative
cask 'android-platform-tools' # Android command line tools -- adb
cask 'android-sdk' # Android
cask 'android-studio' # Android IDE & Emulators
cask 'angry-ip-scanner' # IP/Port scanner
cask 'appcleaner' # App uninstaller
cask 'arduino' # IDE for Arduino
# cask 'asepsis' # Prevents .DS_Store files (disable SIP)
cask 'avocode' # Mockup to code
cask 'atom' # Text editor
cask 'audiobookbinder' # Create iTunes compatible .m4b audiobooks
cask 'balenaetcher' # Image writer
cask 'bartender' # Hides menubar items
cask 'burn' # CD burner
# cask 'busycal' # Calendar manager (setapp)
# cask 'busycontacts' # Contacts manager (setapp)
cask 'cardhop' # Contacts manager
cask 'ccleaner' # System cleanup
cask 'charles' # Debugging Proxy
cask 'chatology' # iMessage enhancer and search
cask 'chromium' # Web browser
cask 'clone-hero' # Rhythm Game
cask 'clover-configurator' # Clover bootloader editor
# cask 'dash' # Offline API Documentation
cask 'denemo' # Music notation (LilyPond)
cask 'devonthink' # Evernote alternative
cask 'discord' # Chat
cask 'discord-canary' # Chat
cask 'docker' # App containers
cask 'dropbox' # Cloud backup
cask 'duet' # ipad as second monitor
cask 'fantastical' # Calendar
cask 'firefox' # Web broswer
cask 'firefox-developer-edition' # Web broswer
cask 'flash-npapi' # Flash for Safari & Firefox. PPAPI is for Chromium & Opera
cask 'flux' # Screen colorization based on time
cask 'fontplop' # create webfonts from .ttf
cask 'fork' # Git GUI
cask 'free-ruler' # Pixel ruler
cask 'frescobaldi' # Music notation (LilyPond)
cask 'gas-mask' # Hosts file manager
cask 'gisto' # Github gist manager
cask 'github' # Github repo manager
cask 'glyphs' # Font editor
cask 'google-chrome' # Browser
cask 'google-chrome-canary' # Browser
cask 'google-drive-file-stream' # Cloud backup
cask 'gpg-suite' # OpenPGP
cask 'grandperspective' # File system analyzer
cask 'graphiql' # GraphQL GUI
cask 'graphql-playground' # GraphQL GUI
cask 'handbrake' # Video transcoder
cask 'haskell-for-mac' # IDE for haskell
cask 'integrity' # Website link checker (Also on app store)
cask 'istat-menus' # Menubar widgets
cask 'iterm2' # Terminal emulator
cask 'itsycal' # Menubar calendar
cask 'jdownloader' # Download manager
cask 'kaleidoscope' # File diff
cask 'karabiner-elements' # Keyboard customization
cask 'keka' # File compression
cask 'kodi' # Media player
cask 'leech' # Download manager
cask 'libreoffice' # Office applications
cask 'lilypond-dev' # Music notation
# cask 'little-snitch' # Firewall
cask 'lmms' # Digital audio workstation
cask 'logitech-unifying' # Logitech drivers
cask 'lepton' # Snippets
cask 'losslesscut' # Trim video and audio files
cask 'makemkv' # Bluray rip - Free registration https://www.makemkv.com/forum/viewtopic.php?f=5&t=1053
cask 'marked' # preview markdown from any editor
cask 'meshcommander' # Intel AMT
cask 'microsoft-office' # Office applications
cask 'monodraw' # Plain text drawing
cask 'moom' # Window manager
cask 'musicbrainz-picard' # Mp3 metadata editor
cask 'mp3tag' # Mp3 metadata editor
cask 'mpv' # Media player
cask 'musescore' # Music notation
cask 'mysqlworkbench' # MySQL GUI
cask 'navicat-premium' # Multi-database GUI
cask 'ngrok' # Public tunnel to localhost
cask 'nvalt' # Notes
cask 'obs' # Screen broadcasting
cask 'onyx' # System maintence
cask 'parallels' # Virtual machines
cask 'paw' # API tester
cask 'plex' # Media player
cask 'plex-media-player' # Media player
cask 'plex-media-server' # Media server
cask 'postgres' # Database
cask 'postico' # PostgresSQL GUI
cask 'postman' # API tester
cask 'qsyncthingtray' # Syncthing tray icon
cask 'quickbooks2016' # Accounting
cask 'rclone-browser' # rclone GUI
cask 'rectangle' # Window manager
cask 'rescuetime' # Time tracker
cask 'react-native-debugger' # React Native GUI
cask 'robofont' # Font editor
# cask 'screens' # VNC client (setapp)
cask 'setapp' # Multi app installer
cask 'sketch-beta' # Vector drawing
cask 'skype' # Chat
cask 'sloth' # Open files and sockets monitor
cask 'slack' # Chat
cask 'soundflower' # Virtual audio interface (HDMI volume changer)
cask 'soundflowerbed' # soundflower GUI
cask 'sourcetree' # Git repo manager
cask 'spectacle' # Window manager
cask 'steam' # Games
cask 'steelseries-exactmouse-tool' # Mouse deacceleration
cask 'sublime-merge' # Git repo manager
cask 'sublime-text' # Text editor
cask 'synergy' # Mouse and keyboard sharing
# cask 'tableplus' # Multi-database GUI (setapp)
cask 'teamviewer' # Screen sharing
cask 'telegram' # Chat
# cask 'timing' # Time tracker (setapp)
cask 'tomighty' # Task timer
cask 'tower' # Git repo manager
cask 'transmission' # Torrent downloader
# cask 'tripmode' # Mobile data blocker (setapp)
cask 'tunnelblick' # VPN client
cask 'veracrypt' # Encryption. TrueCrypt fork
cask 'vimr' # macvim replacement
cask 'virtualbox' # Virtual machines
cask 'virtualbox-extension-pack' # Support USB, RDP, Encryption, NVMe, and PXE
cask 'viscosity' # VPN client
cask 'visual-studio-code-insiders' # Text editor
cask 'vlc' # Media player
cask 'vmware-fusion' # Virtual machines
cask 'wireshark' # Network analyzer
cask 'xld' # FLAC/MP3 Conversion, Ripper, Burner
cask 'xtrafinder' # Finder enhancer (disable SIP)
cask 'zoomus' # Chat

# [Quick Look Plugins](https://github.com/sindresorhus/quick-look-plugins)
# Not sorted
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
# cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-pat'

# FONTS
# brew search /nerd-font/ | grep font | xargs brew cask install -f

# DRIVERS
cask 'asix-ax88179'
# cask 'solarflare-network-adapter' # 404
cask 'xbox360-controller-driver-unofficial'

# PREREQ
cask 'osxfuse'
# cask 'xquartz'
#
# brew 'ntfs-3g' # Requires osxfuse
# brew 'sshfs' # Requires osxfuse
# cask 'fontforge' # Requires xforce

# APP STORE
mas 'Day One Classic', id: 422304217
mas 'Deckset', id: 847496013
mas 'LimeChat', id: 414030210
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334
mas 'Xcode', id: 497799835
