tap "argon/mas"
tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
tap "ravenac95/sudolikeaboss"
tap "sscotth/sip"
tap "sscotth/sound-control"
tap "vitorgalvao/tiny-scripts"
cask "java"
cask "osxfuse"
cask "xquartz"
brew "ack"
brew "openssl"
brew "archey"
brew "argtable"
brew "aria2"
brew "automake"
brew "bash"
brew "binutils"
brew "bison"
brew "chruby"
brew "coreutils"
brew "ddrescue"
brew "diff-so-fancy"
brew "diffstat"
brew "diffutils"
brew "docker"
brew "ed", args: ["with-default-names"]
brew "libffi"
brew "emacs"
brew "expect"
brew "file-formula"
brew "findutils"
brew "flow"
brew "readline"
brew "gawk"
brew "gdbm"
brew "git"
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-units", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "gpatch"
brew "gperf"
brew "graphicsmagick"
brew "grep", args: ["with-default-names"]
brew "groff"
brew "gzip"
brew "handbrake"
brew "htop"
brew "python"
brew "httpie"
brew "httrack"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lame"
brew "less"
brew "libyaml"
brew "lolcat"
brew "mackup"
brew "macvim"
brew "make", args: ["with-default-names"]
brew "python@2"
brew "mongodb"
brew "moreutils"
brew "mysql@5.7", restart_service: true
brew "nano"
brew "neovim"
brew "ntfs-3g"
brew "nvm"
brew "openssh"
brew "openssl@1.1"
brew "r"
brew "ranger"
brew "rclone"
brew "rethinkdb"
brew "rsync"
brew "ruby-install", args: ["HEAD"]
brew "s3cmd"
brew "screen"
brew "shellcheck"
brew "sshfs"
brew "sshuttle"
brew "subversion"
brew "syncthing"
brew "syncthing-inotify"
brew "tccutil"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tmux"
brew "trash"
brew "tree"
brew "vim", args: ["with-override-system-vi"]
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "mas"
brew "heroku/brew/heroku"
brew "ravenac95/sudolikeaboss/sudolikeaboss"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password6"
cask "adobe-acrobat-reader"
cask "aerial"
cask "airmail-beta"
cask "airserver"
cask "airtool"
cask "alfred"
cask "anydesk"
cask "apache-couchdb"
cask "appcleaner"
cask "asix-ax88179"
cask "atom"
cask "atom-beta"
cask "audiobookbinder"
cask "balsamiq-mockups"
cask "bartender"
cask "bettertouchtool"
cask "brackets"
cask "brave"
cask "burn"
cask "busycal"
cask "busycontacts"
cask "calibre"
cask "camtasia"
cask "ccleaner"
cask "charles-beta"
cask "charles"
cask "chromedriver"
cask "chromium"
cask "clover-configurator"
cask "codekit"
cask "controlplane"
cask "dash"
cask "devonthink-pro-office"
cask "discord-canary"
cask "discord"
cask "docker"
cask "dropbox-beta"
cask "duet"
cask "endurance"
cask "etcher"
cask "evernote"
cask "fantastical"
cask "filezilla"
cask "firefox"
cask "firefoxdeveloperedition"
cask "flash-npapi"
cask "flash-player"
cask "flux"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-hack"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-monoid"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "fontforge"
cask "fontprep"
cask "free-ruler"
cask "frescobaldi"
cask "gas-mask"
cask "genymotion"
cask "gisto"
cask "github-beta"
cask "gitter"
cask "glueprint"
cask "glyphs"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-drive-file-stream"
cask "google-trends"
cask "gpg-suite"
cask "grandperspective"
cask "handbrake"
cask "haskell-for-mac"
cask "hipchat"
cask "hyperswitch"
cask "insomniax"
cask "integrity"
cask "istat-menus"
cask "iterm2-beta"
cask "itsycal"
cask "java8"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keka"
cask "kodi"
cask "leech"
cask "lilypond-dev"
cask "liteicon"
cask "little-snitch"
cask "livereload"
cask "lmms"
cask "logitech-unifying"
cask "losslesscut"
cask "macaw"
cask "macid"
cask "makemkv"
cask "mamp"
cask "mancy"
cask "marked"
cask "microsoft-office"
cask "mongodb-compass"
cask "monodraw"
cask "moom"
cask "mplayerx"
cask "mpv"
cask "mysqlworkbench"
cask "ngrok"
cask "nvalt"
cask "obs"
cask "onyx"
cask "openpht"
cask "opera-developer"
cask "parallels"
cask "paw"
cask "plex-media-player"
cask "plex-media-server"
cask "postgres"
cask "postico"
cask "provisionql"
cask "psequel"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qsyncthingtray"
cask "quickbooks"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookapk"
cask "quicklookase"
cask "rclone-browser"
cask "rescuetime"
cask "robo-3t"
cask "robofont"
cask "rocket"
cask "rodeo"
cask "rstudio"
cask "sabnzbd"
cask "safari-technology-preview"
cask "screens"
cask "scroll-reverser"
cask "shuttle"
cask "skype"
cask "slack"
cask "sound-control"
cask "soundflower"
cask "sourcetree"
cask "spectacle"
cask "steam"
cask "steelseries-exactmouse-tool"
cask "stremio"
cask "studio-3t"
cask "sublime-text"
cask "suspicious-package"
cask "switchresx"
cask "tableplus"
cask "teamviewer"
cask "telegram"
cask "thyme"
cask "tomighty"
cask "tower"
cask "transmission"
cask "tripmode"
cask "tunnelblick"
cask "unetbootin"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "webkit-build-archive"
cask "webpquicklook"
cask "webstorm"
cask "wireshark"
cask "xbox360-controller-driver-unofficial"
cask "xld"
cask "sscotth/sip/asepsis"
cask "sscotth/sip/totalfinder"
cask "sscotth/sip/xtrafinder"
